

* DONE протестировать tea_picture
  CLOCK: [2013-11-30 Сб. 18:32]--[2013-11-30 Сб. 19:30] =>  0:58
  CLOCK: [2013-11-30 Сб. 14:39]--[2013-11-30 Сб. 15:27] =>  0:48
  - Note taken on [2013-11-30 Сб. 00:34] \\

    Должно давать удалять только свои картинки, либо любые,
    если ты - владелец чая

* DONE протестировать tea_link
  CLOCK: [2013-11-30 Сб. 19:31]--[2013-11-30 Сб. 20:04] =>  0:33
  - Note taken on [2013-11-30 Сб. 00:35] \\
    аналогично tea_picture

* DONE коменты для чаев
* DONE Не удалять чай, если есть другие пользователи
  CLOCK: [2013-12-07 Сб. 15:51]--[2013-12-07 Сб. 16:15] =>  0:24
  - Note taken on [2013-11-30 Сб. 00:36] \\
    Если чай находится в списках у других пользователей, то
    при удалении чая он просто отвязывается от текущего
    пользователя и переназначается другому, рандомному.
* DONE Добавить год сбора чая.
  CLOCK: [2013-12-07 Сб. 16:16]--[2013-12-07 Сб. 17:22] =>  1:06
* DONE При удалении из списка попробованных удалить также сравнения этого чая
  CLOCK: [2013-12-07 Сб. 22:33]--[2013-12-07 Сб. 22:59] =>  0:26
  CLOCK: [2013-12-07 Сб. 17:22]--[2013-12-07 Сб. 18:00] =>  0:38
* DONE дизайн
** DONE Просмотр картинки чая
** DONE Создание ссылки чая
** DONE Сравнение чаев
** DONE выбор второго чая
   CLOCK: [2013-12-18 Ср. 22:11]--[2013-12-18 Ср. 22:33] =>  0:22
   - Note taken on [2013-12-18 Ср. 22:11] \\
     показывать галочку возле чая который имеет хоть одно
     сравнение
** DONE Список чаев
   CLOCK: [2013-12-18 Ср. 22:34]--[2013-12-18 Ср. 22:59] =>  0:25
* DONE Проверять, что ссылка - это валидный URL
* TODO имена для пользователей
  - Note taken on [2013-12-01 Вс. 00:40] \\
    Добавить пользователям имя, в коментариях показывать
    имя вместо емейла
* DONE ускорить ресайз гифок, задать ограничения на размер картинки
* TODO сделать нормальный классификатор чаев
* TODO интеграционные тесты
  - Note taken on [2013-11-30 Сб. 00:40] \\
    Особо не упарывать, главное - осилить, сделать по минимуму
* TODO логин через социальные сети
* TODO В чае показывать оси
  - Note taken on [2013-11-30 Сб. 00:43] \\
    На странице с чаем показывать внизу оси

    на каждой оси слева непосредственно слабые чаи,
    справа - сильные. Это пока будет замена полноценным
    осям
* TODO Сделать оси
  - Note taken on [2013-11-30 Сб. 00:41] \\
    Для этого придется решить задачку раскладывания графа
    на плоскости
** Алгоритмы
*** Разложение графа на плоскости
    - Note taken on [2013-11-30 Сб. 14:28] \\
      Представить обобщенное мнение всех пользователей в виде
      напрвленного взвешенного графа.

      Каждый чай - это вершина графа, мнение пользователя -
      это дуга. Дуги направлены в сторону более сильного чая
      и имеют вес - количество пользователей, которые так
      считают.

      Задача состоит в том, чтобы разложить граф на плоскости
      так, чтобы сумма квадратов разностей длин дуг и их весов
      была минимальна. Также нужно минимизировать сумму
      квадратов углов по отношению к оси OX.
* TODO индексы в базе
* TODO сделать нормальные списки
  - Note taken on [2013-12-19 Чт. 23:19] \\
    Подумать, какие нужны списки, взаимосвязи между
    ними. Если чай есть в списке рекомендованных, должен ли
    он находиться перед этим в списке попробованных. и так далее
* TODO Кнопки в чае для занесения в списки
  - Note taken on [2013-12-19 Чт. 23:17] \\
    Добавить логичности в кнопки, когда чай в списке
    попробованных убрать кнопку "хочу попробовать"
